OpenFOAM-v2112-AD/applications/discreteAdjointOpenFOAM/adjoint/adjointSimpleCheckpointingFoam/pitzDaily_test/pitzDaily_piggyback/system/checkpointingDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version 2.0;
    format ascii;

    root "..";
    case "multiDuct_opt";
    instance "system";
    local "";

    class dictionary;
    object checkpointDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

checkpointSettings{
    checkpointingMethod piggyback;
}


checkpointRequired    
{
    U;
    p;
    phi;
    epsilon;
    k;
    nut;
    nuTilda;
}


// ************************************************************************* //
